{
    "en": {
        "firstname": "Mihail",
        "lastname": "Divulin",
        "developer": "Web Developer",
        "learnmore": {
            "learn": "Learn",
            "more": "More"
        },
        "about": {
            "hello": "Hello! I'm",
            "main": "I have experience with front-end frameworks such as Vue, Nuxt, React, and Angular. In terms of implementing backend logic, I'm skilled in using Node.js, Express, and both SQL and NoSQL (MongoDB and Firebase) databases. With a background in both frontend and backend development, I effectively bridge the gap between implementing visual aspects of website and technical performance, ensuring a seamless user experience. I thrive on solving complex development challenges by leveraging my skills to create efficient and maintainable websites."
        },
        "discoverprojects": {
            "discover": "Discover",
            "projects": "Projects"
        },
        "projects": {
            "visit": "Visit Project",
            "source": "Source",
            "1": "Tweeter is a simple social network platform inspired by Twitter, built as part of a legacy DevChallenges.io fullstack developer challenges. Being part of a coding challenge, it emulates core feautres of popular social media platforms. Tweeter allows users to create an account, login, follow other users, create, save, like and repost posts, reply to each other's posts. The website was developed mainly using modern framework, Nuxt, which handles both the frontend and backend, ensuring responsive user experience and robust server-side functionality. As for the database - PostgreSQL was selected for its powerful queries and flexible schemas. With a focus on simplicity, this project demonstrates key concepts in modern website development - such as state management, database integration and component-based architecture.",
            "2": "This project dedicated to a Warcraft III custom map, offering a comprehensive database of all playable heroes. Each hero page features detailed talents and ability descriptions, along with video previews - all of which can be edited by authorised users on the website itself. The site also includes a player stats section, where match data is pulled in real time from a Google Sheets document using Google Sheets API, allowing the community to track rankings more easily. This website is built with Nuxt for server-side rendering and smooth navigation. Additionally, it supports multiple languages via i18n, making it accessible to a global player base (although currently english translation for heroes description is kinda cursed). This project serves both as a useful resource for community and a demonstration of full-stack capability, combining dynamic content management with responsive design.",
            "3": "Unsplash Collection is a full-stack web application based on DevChallenges.io challenge. This project was developed using the FERN stack (Firebase, Express, React, Node.js) and demonstrates key full-stack development skills, including API integration, and database management. Users can browse Unsplash images, create custom collections, and save their favourite photos with a clean, responsive UI built in React and styled with TailwindCSS. ",
            "4": "Code Sharing App is a part of a DevChallenges.io full-stack project challenges. Built with FEAN stack (Firebase, Express, Angular, Node.js) this website allows developers to write code in multiple languages and generate unique shareable links to it. The frontent, built with Angular, features an integrated code editor (Monaco Eeditor) for real time syntax highlighting and editing, while the responsive UI ensures seamless use across devices. On the backend, Node.js with express handles storage of unique shareable links in Firebase Firestore, with uuid generating unique IDs for each shared snippet.",
            "5": "My first project - a simple rock-paper-scissors app, that was developed as part of a legacy DevChallenges.io challenges. It uses Next.js (React based library) for front-end and doesn't require a backend, as all data is stored in local storage."
        },
        "reach": {
            "1": "Let's create more together! Reach out at",
            "2": "to collaborate."
        }
    },
    "ru": {
        "firstname": "Михаил",
        "lastname": "Дивулин",
        "developer": "Разработчик",
        "learnmore": {
            "learn": "Узнать",
            "more": "Больше"
        },
        "about": {
            "hello": "Привет! Я",
            "main": "Я работаю с такими фронтенд-фреймворками, как Vue, Nuxt, React и Angular, создавая интерактивные и отзывчивые пользовательские интерфейсы. При работе с бэкендом я использую такие технологии, как Node.js, Express, SQL и NoSQL (MongoDB и Firebase) базы данных. Обладая навыками как во фронтенд-, так и в бэкенд-разработке, я эффективно объединяю визуальную составляющую веб-сайта с его функциональной частью, обеспечивая бесшовное взаимодействие пользователя с сайтом. Я стремлюсь решать сложные задачи в разработке, используя свой опыт работы как с клиентской, так и с серверной частью для создания эффективных и легко поддерживаемых сайтов."
        },
        "discoverprojects": {
            "discover": "Прошлые",
            "projects": "Проекты"
        },
        "projects": {
            "visit": "Посетить проект",
            "source": "Источник",
            "1": "Tweeter это простая социальная сеть вдохновленная Twitter, созданная в рамках одного из старых челленджей фуллстак разработчика от DevChallenges.io. Являясь частью задания, проект воспроизводит ключевые функции популярных социальных сетей. Пользователи Tweeter могут создавать аккаунты, входить в систему, подписываться на других пользователей, создавать, сохранять, лайкать и репостить записи, а также отвечать на посты друг друга. Сайт был разработан с использоваинем современного фреймворка Nuxt, который объединяет в себе как фронтенд, так и бэкенд, обеспечивая отзывчивый пользовательский интерфейс и надежную серверную функциональность. В качестве базы данных была выбрана PostgreSQL за счёт своих мощных возможностей запросов и гибкости в работе со схемами. Проект сфокусриован на простоте и демонстрирует ключевые концепции современной веб-разработки - такие как state management, интеграция баз данных и компонентно-ориентированная архитектура.",
            "2": "Этот проект посвящен пользовательской карте на Warcraft III и представляет собой полноценную базу данных всех доступных персонажей. На странице каждого персонажа доступны подробные описания их умений и талантов, а также видео-превью способностей - всё это может быть отредактировано прямо на сайте авторизованными пользователями. На сайте также реализован раздел статистики игроков, где текущие данные статистики подгружаются из документа Google Sheets с помощью Gooogle Sheets API, что позволяет сообществу более удобно отслеживать свою статистику. Сайт создан с применением Nuxt, что обеспечивает серверный рендеринг и плавную навигацию. Кроме того реализована поддержка нескольких языков с помощью i18n, что делает проект доступным для более широкого круга людей (хотя текущий перевод описаний на английский пока оставляет желать лучше). Этот проект одновременно является полезным ресурсом для сообщества и демонстрацией моих способностей в качестве фуллстак разработчика, так как он объединяет в себе управление динамическим контентом с адаптивным и современным дизайном.",
            "3": "Unsplash Collection это веб-приложение, созданное на основе задания с платформы DevChallenges.io. Проект разработан  использованием стека FERN (Firebase, Express, React, Node.js) и демонстрирует ключевые навыки full-stack разработки, такие как интеграция с API и управление базами данных. Пользователи могут просматривать изображения с Unsplash, создавать собственные коллекции и сохранять избранные фотографии используя чистый, адаптивный интерфейс, созданный с помощью React с применением технологии TailwindCSS.",
            "4": "Code Sharing App - это проект из серии full-stack заданий на платформе DevChallenges.io. Приложение создано с использованием стака FEAN (Firebase, Express, Angular, Node.js), оно позволяет разработчикам писать код на разных языках программирования, а также генерировать уникальные ссылки для того чтобы делиться им. Фронтенд был реализован на Angular и включает в себя встроенный редактор Monaco Editor с возможностью подсветки синтаксиса. Адаптивный интерфейс обеспечивает удобную работу на любых устройствах. На стороне бэкенда Node.js вместе с Express обрабатывают сохранение уникальных ссылок в базе данных Firebase Firestore, а библиотека uuid используется для генерации идентификаторов для каждого фрагмента кода.",
            "5": "Мой первый проект - простое приложение \"Камень-ножницы-Бумага\", разработанное в рамках одного из старых заданий на платформе DevChallenges.io. В качетсве фронтенда используется Next.js (фреймворк на базе React), а бэкенд не используется, так как все данные сохраняются в локальном хранилище браузера."
        },
        "reach": {
            "1": "Создадим больше вместе! Свяжитесь со мной по адресу",
            "2": "для сотрудничества."
        }
    },
    "ua": {
        "firstname": "Михайло",
        "lastname": "Дівулін",
        "developer": "Розробник",
        "learnmore": {
            "learn": "Читати",
            "more": "Більше"
        },
        "about": {
            "hello": "Привіт! Я",
            "main": "Я працюю з такими фронтенд-фреймворками, як Vue, Nuxt, React та Angular, створюючи інтерактивні та адаптивні користувацькі інтерфейси. У роботі з бекендом використовую такі технології, як Node.js, Express, SQL і NoSQL (бази даних MongoDB та Firebase). Володіючи навичками як у фронтенд-, так і в бекенд-розробці, я ефективно поєдную візуальну складову вебсайту з його функціональною частиною, забезпечуючи плавну взаємодію користувача з ресурсом. Я прагну вирішувати складні завдання в розробці, використовуючи свій досвід для створення ефективних та зручних у підтримці сайтів."
        },
        "discoverprojects": {
            "discover": "Минулі",
            "projects": "Проекти"
        },
        "projects": {
            "visit": "Перейти до проєкту",
            "source": "Джерело",
            "1": "Tweeter - це проста соціальна мережа, натхненна Twitter, створена в межах одного зі старих фулстек-челенджів на DevChallenges.io. Оскільки проєкт був частиною завдання, він відторює ключові функції популярних социальних мереж. Користувачі Tweeter можуть створювати акаунти, входити в систему, підписуватись на інших користувачів, створювати, зберігати, вподобувати та репостити дописи, а також відповідати на пости одне одного. Сайт розроблено за допомогою сучасного фреймворку Nuxt, який поєднує в собі як фронтенд, так і бекенд, забезпечуючи адаптивний інтерфейс та надійну серверну функциональність. У якості бази даних було обрано PostgreSQL - завдяки потужним можливостям запитів і гнучкості в роботі зі схемами. Цей проект, зосереджений на простоті, демонструє ключові концепції сучасної веброзробки - такі як state management, інтеграція баз даних і компонентно-орієнтована архітектура.",
            "2": "Цей проект присвячений користувацькій карті для Warcraft III і являє собою повноцінну базу даних усіх доступних персонажів. На сторінці кожного героя доступні детальні описи і відопрев'ю їх здібностей і талантів - усе це може редагуватися безпосередньо на сайті авторизованими користувачами. Також на сайті реализовано розділ статистики гравців, де поточні статистичні дані підтягуються з документа Google Sheets за допомогою Google Sheets API, що дозволяє спільноті зручно відстежувати свою статистику. Сайт створено з використанням Nuxt, що забезпечує серверний рендеринг та плавну навігацію. Крім того, реалізована підтримка кількох мов да помогою i18n, що робить проєкт доступним біль ширшої аудиторії (хоча поточний переклад описів англійською ще потребує доопрацювання). Цей проєкт є одночасно корисним ресурсом для спільноти та демонстрацією моїх навичок як фулстак-розробника, адже поєднує керування динамічним контентом із адаптивним і сучасним дизайном.",
            "3": "Unsplash collection це веб застосунок, створений на основі завдання с платформи DevChallenges.io. Проект розроблено с використанням теку FERN (Firebase, Express, React, Node.js) і він демонструє ключові навички full-stack розробки, зокрема інтеграцію з API та керування базами даних. Користувачі можуть переглядати зображення з Unsplash, створювати колекції та зберігати улюблені фотографії за допомогою чистого, адаптивного інтерфейсу, реалізованого на React з використанням технології TailwindCSS.",
            "4": "Code Sharing App - це проект із серії full-stack завдань на платформі DevChallenges.io. Застосунок створено з використанням стеку FEAN (Firebase, Express, Angular, Node.js), воно дозволяє розробникам писати код на різних мовах програмування, а також генерувати унікальні посилання для його розповсюдження. Фронтенд було реалізовано за допомогою Angular і він включає в себе вбудований редактор Monaco Editor з підсвіткою синтаксису. Адаптивний інтерфейс забезпечує зручне використання на будь-яких пристроях. На бекенді Node.js разом з Express відповідає за збереження унікальних посилань у базі даних Firebase Firestore а бібліотека uuid застосовується для генерації ідентифікаторів для кожного фрагмента коду.",
            "5": "Мій перший проект - простий застосунок \"Камінь-Ножиці-Папір\", створений у межах одного зі старих завдань на платформі DevChallenges.io. Для фронтенду використовується Next.js (фреймворк на основі React), а бекенд не використовується, оскільки всі дані зберігаються в локальному сховищі браузера."
        },
        "reach": {
            "1": "Створимо більше разом! Зв`язатись за адресою",
            "2": "для співпраці."
        }
    }
}